app/wsdl/billService_n2.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp200409="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsp200607="http://www.w3.org/2006/07/ws-policy" xmlns:ns0="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:ns1="http://service.sunat.gob.pe" xmlns:ns2="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/">
<wsdl:binding name="BillServicePortBinding" type="ns1:billService">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<wsdl:operation name="getStatus">
<soap12:operation soapAction="urn:getStatus" soapActionRequired="true" style="document"/>
<wsdl:input name="getStatusRequest">
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output name="getStatusResponse">
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="sendBill">
<soap12:operation soapAction="urn:sendBill" soapActionRequired="true" style="document"/>
<wsdl:input name="sendBillRequest">
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output name="sendBillResponse">
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="sendPack">
<soap12:operation soapAction="urn:sendPack" soapActionRequired="true" style="document"/>
<wsdl:input name="sendPackRequest">
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output name="sendPackResponse">
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="sendSummary">
<soap12:operation soapAction="urn:sendSummary" soapActionRequired="true" style="document"/>
<wsdl:input name="sendSummaryRequest">
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output name="sendSummaryResponse">
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
</wsdl:definitions>